In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"name":["a","b","c","d","a","c","b","a","d","c"],
                   "s1":[1,2,3,4,5,6,7,8,9,10],
                   "s2":[11,12,13,14,15,16,17,181,19,20]})

In [3]:
var

  name  s1   s2
0    a   1   11
1    b   2   12
2    c   3   13
3    d   4   14
4    a   5   15
5    c   6   16
6    b   7   17
7    a   8  181
8    d   9   19
9    c  10   20

In [5]:
var1 = var.groupby("name")

In [7]:
for v1,v2 in var1:
    print(v1)
    print(v2)
    print("\n")

a
  name  s1   s2
0    a   1   11
4    a   5   15
7    a   8  181


b
  name  s1  s2
1    b   2  12
6    b   7  17


c
  name  s1  s2
2    c   3  13
5    c   6  16
9    c  10  20


d
  name  s1  s2
3    d   4  14
8    d   9  19

In [8]:
var1.get_group("a")

  name  s1   s2
0    a   1   11
4    a   5   15
7    a   8  181

In [9]:
var1.min()

      s1  s2
name
a      1  11
b      2  12
c      3  13
d      4  14

In [10]:
var1.max()

      s1   s2
name
a      8  181
b      7   17
c     10   20
d      9   19

In [11]:
var1.mean()

            s1         s2
name
a     4.666667  69.000000
b     4.500000  14.500000
c     6.333333  16.333333
d     6.500000  16.500000